renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/serial_terminal_task.c
                                            sci_buffer[current_buffer_pointer] = 0;
                                            /* +1 means '\0' as a string terminator */
                                            if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)target, strlen(target), (uint8_t *)sci_buffer, strlen((const char *)sci_buffer) + 1))
                                            {
                                                sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                                display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                            }
                                            else
                                            {
                                                sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                                display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                            }
                                            break;
                                        }
                                        if((strstr(sci_buffer, "quit")) || (strstr(sci_buffer, "exit")))
                                        {
                                            break;
                                        }
                                        if(current_buffer_pointer == SCI_BUFFER_SIZE)
                                        {
                                            memset(sci_buffer, 0, SCI_BUFFER_SIZE);
                                            current_buffer_pointer = 0;
                                        }
                                    }
                                }
                                else if((!strcmp((const char *)arg3, "mqttbrokerendpoint")))
                                {
                                    /* +1 means '\0' as a string terminator */
                                    if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)mqtt_broker_endpoint_label, strlen(mqtt_broker_endpoint_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                        display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                    else
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                        display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                }
                                else if((!strcmp((const char *)arg3, "iotthingname")))
                                {
                                    /* +1 means '\0' as a string terminator */
                                    if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)iot_thing_name_label, strlen(iot_thing_name_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                        display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                    else
                                    {
                                        sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                        display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    }
                                }
                                else
                                {
                                    sprintf(message_buffer, "unknown argument3 = %s.\n", arg3);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tcpsendperformanceserveripaddress")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tcp_send_performance_server_ip_address_label, strlen(tcp_send_performance_server_ip_address_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tcpsendperformanceserverportnumber")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tcp_send_performance_server_port_number_label, strlen(tcp_send_performance_server_port_number_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tracealyzerserveripaddress")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tracealyzer_server_ip_address_label, strlen(tracealyzer_server_ip_address_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else if((!strcmp((const char *)arg2, "tracealyzerserverportnumber")))
                            {
                                /* +1 means '\0' as a string terminator */
                                if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)tracealyzer_server_port_number_label, strlen(tracealyzer_server_port_number_label), (uint8_t *)arg3, strlen((const char *)arg3) + 1))
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_SUCCESS);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    sprintf(message_buffer, DATA_FLASH_STORE_FAIL);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                            }
                            else
                            {
                                sprintf(message_buffer, "unknown argument2 = %s.\n", arg2);
                                display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                            }
                        }
                        else if(!strcmp((const char *)arg1, "read"))
                        {
                            R_SFD_ResetScan();
                            while(1)
                            {
                                if(SFD_SUCCESS == R_SFD_Scan(&label, &label_length, &data, &data_length))
                                {
                                    sprintf(message_buffer, "label = ");
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    memcpy(message_buffer, label, label_length);
                                    message_buffer[label_length] = 0;
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "\n");
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "data = ");
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    memcpy(message_buffer, data, data_length);
                                    message_buffer[data_length] = 0;
                                    for(int i = 0; i < strlen(message_buffer); i++)
                                    {
                                        if((message_buffer[i] < 0x20) || (message_buffer[i] > 0x7e))
                                        {
                                            if((message_buffer[i] != 0x0a) && (message_buffer[i] != 0x0d))
                                            {
                                                strcpy(message_buffer, "Could not print: <binary data> is included.");
                                                message_buffer[strlen(message_buffer)] = 0;
                                                break;
                                            }
                                        }
                                    }
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    vTaskDelay(100); /* 長い文字列をSCI(UART)出力した際に最後のほうが出力されない。完了待ちの方法が不明なためとりあえず時間待ち */
                                    sprintf(message_buffer, "\n");
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "data_length(includes string terminator 1byte zero) = %d", data_length);
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                    sprintf(message_buffer, "\n\n");
                                    display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                                }
                                else
                                {
                                    break;
                                }
                            }
                        }
                        else if(!strcmp((const char *)arg1, "erase"))
                        {
                            R_SFD_EraseAll();
                            sprintf(message_buffer, "completed erasing all flash.\n");
                            display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        else
                        {
                            sprintf(message_buffer, "unknown argument1 = %s.\n", arg1);
                            display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
                        }
                        break;
                    default:
                        display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, COMMAND_NOT_FOUND);
                        break;
                }
                display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, PROMPT);
            }
            else
            {

