renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/serial_terminal_task.c
            }
            current_buffer_pointer = 0;
            memset(sci_buffer, 0, SCI_BUFFER_SIZE);
            memset(command, 0, COMMAND_SIZE);
            memset(arg1, 0, ARGUMENT1_SIZE);
            memset(arg2, 0, ARGUMENT2_SIZE);
            memset(arg3, 0, ARGUMENT3_SIZE);
            memset(arg4, 0, ARGUMENT4_SIZE);
            memset(message_buffer, 0, MESSAGE_BUFFER_SIZE);
        }
        else if(current_buffer_pointer == SCI_BUFFER_SIZE)
        {
            memset(sci_buffer, 0, SCI_BUFFER_SIZE);
            current_buffer_pointer = 0;
        }
    }
}

static int32_t get_command_code(uint8_t *command)
{
    int32_t return_code;

    if(!strcmp((char*)command, "freertos"))
    {
        return_code = COMMAND_FREERTOS;
    }
    else if(!strcmp((char*)command, "version"))
    {
        return_code = COMMAND_VERSION;
    }
    else if(!strcmp((char*)command, "timezone"))
    {
        return_code = COMMAND_TIMEZONE;
    }
    else if(!strcmp((char*)command, "reset"))
    {
        return_code = COMMAND_RESET;
    }
    else if(!strcmp((char*)command, "dataflash"))
    {
        return_code = COMMAND_DATAFLASH;
    }
    else
    {
        return_code = COMMAND_UNKNOWN;
    }
    return return_code;
}

static void display_serial_terminal_putstring_with_uart(WM_HWIN hWin_handle, sci_hdl_t sci_handle, char *string)
{
    uint16_t str_length = 0;
    volatile uint16_t transmit_length = 0;
    sci_err_t sci_err;
    uint32_t retry = 0xFFFF;

    display_serial_terminal_putstring(hWin_handle, string);

    str_length = (uint16_t)strlen(string);

    while ((retry > 0) && (str_length > 0))
    {
        R_SCI_Control(sci_handle, SCI_CMD_TX_Q_BYTES_FREE, (void *)&transmit_length);

        if(transmit_length > str_length)
        {
            transmit_length = str_length;
        }

        sci_err = R_SCI_Send(sci_handle, (uint8_t *) string,
                             transmit_length);

        if ((sci_err == SCI_ERR_XCVR_BUSY) || (sci_err == SCI_ERR_INSUFFICIENT_SPACE))
        {
            retry--; // retry if previous transmission still in progress or tx buffer is insufficient.
            continue;
        }

        str_length -= transmit_length;
        string += transmit_length;

        xSemaphoreTake(xSemaphore, portMAX_DELAY);

    }

    if (SCI_SUCCESS != sci_err)
    {
        R_BSP_NOP(); //TODO error handling code
    }

}

static void sci_callback(void *pArgs)
{
    sci_cb_args_t   *args;
    sci_err_t   sci_err;
    uint8_t tmp;
    static BaseType_t xHigherPriorityTaskWoken;

    args = (sci_cb_args_t *)pArgs;

    if (args->event == SCI_EVT_RX_CHAR)
    {
        /* From RXI interrupt; received character data is in args->byte */
        nop();
        sci_err = R_SCI_Receive(sci_handle, &tmp, 1);
        if(sci_err == SCI_SUCCESS)
        {
            xQueueSendFromISR(xQueue, &tmp, NULL);
        }
    }
    else if (args->event == SCI_EVT_RXBUF_OVFL)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in args->byte
           You will need to increase buffer size or reduce baud rate */
        nop();
    }
    else if (args->event == SCI_EVT_OVFL_ERR)
    {
        /* From receiver overflow error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_FRAMING_ERR)
    {
        /* From receiver framing error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_PARITY_ERR)
    {
        /* From receiver parity error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_TEI)
    {
        xSemaphoreGiveFromISR( xSemaphore, &xHigherPriorityTaskWoken );
    }
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
}

void vConfigureTimerForRunTimeStats(void)
{
    uint32_t channel;
    /* 10us tick timer start */
    R_CMT_CreatePeriodic(100000, _10us_timer_tick, &channel);
}

uint32_t ulGetRunTimeCounterValue(void)
{
    return _10us_timer_count;
}

void _10us_timer_tick(void *arg)
{
    _10us_timer_count++;
}
